import {
  AssemblingAndMovingServices,
  AssemblingAndMovingSteps,
} from "@/types/assembling-and-moving";
import { FaqItem } from "@/types/faq-item";

export const inspectionSteps: AssemblingAndMovingSteps[] = [
  {
    title: "الاتصال",
    description: "التواصل معنا وتحديد موعد",
  },
  {
    title: "المعاينة",
    description: "وصول الفريق إلى الموقع",
  },
  {
    title: "التقييم",
    description: "نحدد أفضل سعر مناسب",
  },
  {
    title: "النقل",
    description: "نقل الأثاث إلى الموقع الجديد",
  },
];
export const assemblingAndMovingServices: AssemblingAndMovingServices[] = [
  {
    title: "فك وتركيب غرف النوم",
    description:
      "نقوم بفك وتركيب غرف النوم بجميع أنواعها (وطني – أمريكي – ماليزي – صيني – تركي) مع الحفاظ على جميع القطع وإعادة تركيبها بشكل دقيق.",
  },
  {
    title: "فك وتركيب الكنب",
    description:
      "نوفر خدمة فك وتركيب المجالس والكنب بجميع أشكالها، مع تغليفها لحمايتها أثناء النقل.",
  },
  {
    title: "نقل الأثاث المنزلي",
    description:
      "نقدم خدمة نقل الأثاث المنزلي داخل الرياض بكل احترافية، حيث نقوم بفك وتغليف ونقل الأثاث بأمان باستخدام سيارات مجهزة، مع ضمان الحفاظ على جميع القطع من أي خدوش أو تلف أثناء النقل.",
  },
  {
    title: "نقل الأثاث المكتبي",
    description:
      "نقوم بفك وتركيب المكاتب والكراسي ووحدات التخزين للشركات والمكاتب.",
  },
  {
    title: "فك وتركيب المكيفات بالرياض",
    description: "نقدم خدمة فك وتركيب المكيفات بالرياض، وتشمل:",
    list: [
      "فك مكيفات سبليت",
      "فك مكيفات شباك",
      "إعادة تركيب المكيفات في الموقع الجديد",
      "التأكد من التشغيل بعد التركيب",
    ],
  },
  {
    title: "نقل المعدات الثقيلة",
    description:
      "نوفر خدمة نقل المعدات الثقيلة باحترافية عالية باستخدام أدوات ومعدات مخصصة، مع فريق مدرب يضمن نقل القطع الكبيرة بأمان تام بدون أي مخاطر.",
  },
  {
    title: "تغليف الأثاث",
    description: "نوفر لك تجربة نقل متكاملة تشمل:",
    list: [
      "تغليف الأثاث بالكامل",
      "تغليف الزجاج والأواني بعناية",
      "نقل العفش بسيارات مجهزة",
      "استخدام ونش هيدروليكي للأدوار العليا",
    ],
  },
  {
    title: "نقل غرف الطعام",
    description:
      "نقوم بنقل غرف الطعام بعناية فائقة مع تغليف الطاولات والكراسي والزجاج لحمايتها من الكسر أو الخدوش، مع إعادة ترتيبها في المكان الجديد بنفس الشكل.",
  },
  {
    title: "فك وتركيب المطابخ",
    description: "نقدم خدمة احترافية لفك وتركيب المطابخ بجميع أنواعها:",
    list: ["مطابخ خشب", "مطابخ ألومنيوم", "مطابخ خشمونيوم"],
    note: "مع الحفاظ على المقاسات وإعادة تركيبها بنفس الدقة.",
  },
  {
    title: "نقل الأجهزة الكهربائية",
    description:
      "نقوم بنقل الأجهزة الكهربائية مثل الثلاجات والغسالات والشاشات بعناية، مع استخدام مواد تغليف تحميها من الصدمات أثناء النقل.",
  },
  {
    title: "نقل معدات المطاعم",
    description:
      "نقدم خدمات نقل الأثاث داخل الرياض وخارجها، حيث نصل إلى جميع المناطق بسرعة مع توفير سيارات نقل مجهزة وفريق محترف لضمان نقل آمن وسريع.",
  },
  {
    title: "خدمات النقل داخل وخارج الرياض",
    description:
      "نقدم خدمات نقل الأثاث داخل وخارج الرياض بسرعة واحترافية، مع سيارات مجهزة وفريق متخصص يضمن نقل آمن وسريع دون أي تلف.",
  },
];

export const assemblingAndMovingSteps: AssemblingAndMovingSteps[] = [
  {
    title: "الاتصال",
    description: "التواصل معنا وتحديد موعد",
  },
  {
    title: "المعاينة",
    description: "وصول الفريق إلى الموقع",
  },
  {
    title: "الفك ",
    description: "فك الأثاث باستخدام أدوات متخصصة",
  },
  {
    title: "التغليف",
    description: "تغليف الأثاث لحمايته",
  },
  {
    title: "النقل",
    description: "نقل الأثاث إلى الموقع الجديد",
  },
  {
    title: "التركيب",
    description: "إعادة تركيب الأثاث بدقة",
  },
];

export const assemblingAndMovingFAQ: FaqItem[] = [
  {
    question: "هل توفرون خدمة فك وتركيب الأثاث فقط؟",
    answer:
      "نعم، نوفر خدمة فك وتركيب الأثاث بالرياض سواء بشكل منفصل أو مع خدمة نقل العفش حسب طلب العميل، كما نقوم بشراء الأثاث المستعمل بجميع أنواعه بأفضل سعر مع معاينة فورية ودفع نقدي سريع.",
  },
  {
    question: "هل يتم تغليف الأثاث أثناء الفك؟",
    answer: "نعم، نقوم بتغليف جميع القطع لحمايتها من الخدوش أو الكسر.",
  },
  {
    question: "كم تستغرق عملية الفك والتركيب؟",
    answer: "تعتمد على حجم الأثاث، ولكن نحرص على إنجاز العمل في أسرع وقت ممكن.",
  },
  {
    question: "هل الخدمة متوفرة في جميع مناطق الرياض؟",
    answer: "نعم، نغطي جميع أحياء الرياض والمناطق المجاورة.",
  },
];
