export type FaqItem = {
  question: string;
  answer: string;
};

export const faqItems: FaqItem[] = [
  {
    question: "هل تشترون المكيفات المعطلة؟",
    answer:
      "نعم، نشتري الاثاث المستعمل بجميع الحالات سواء كان جديد أو مستعمل أو قديم. نقدم أفضل الأسعار حسب حالة الاثاث..",
  },
  {
    question: "كم يستغرق الوصول إلى موقعي في الرياض؟",
    answer:
      "نوفر خدمة سريعة في نفس اليوم. عادة نصل خلال ساعات قليلة من التواصل معنا حسب موقعك في الرياض.",
  },
  {
    question: "هل تقدمون خدمة فك وتركيب الاثاث؟",
    answer:
      "نعم، نوفر خدمة فك وتركيب ونقل الاثاث بواسطة فريق محترف. نحرص على سلامة القطع أثناء الفك والنقل.",
  },
  {
    question: "كيف يتم الدفع؟",
    answer:
      "الدفع يتم نقداً فوراً بعد الاتفاق على السعر واستلام الأثاث.",
  },
  {
    question: "ما هي المناطق التي تغطونها؟",
    answer:
      "نغطي جميع أحياء الرياض والمناطق المجاورة مثل الخرج والمزاحمية والقويعية والأحساء والقصيم.",
  },
  {
    question: "هل تشترون معدات المطاعم؟",
    answer:
      "نعم، نشتري جميع معدات المطاعم والكافيهات مثل الثلاجات والأفران ومعدات التحضير والأدوات الكهربائية.",
  },
];
